       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         77 WS-YEAR PIC 9999 COMP-5.
         77 WS-RESULT PIC 9 COMP-5.
       PROCEDURE DIVISION.
       LEAP.
         IF (FUNCTION MOD(WS-YEAR, 4) IS EQUAL TO 0
            AND FUNCTION MOD(WS-YEAR, 100) IS NOT EQUAL TO 0)
            OR FUNCTION MOD(WS-YEAR, 400) IS EQUAL TO 0
         THEN
            MOVE 1 TO WS-RESULT
         ELSE
            MOVE 0 TO WS-RESULT
         END-IF.
         CONTINUE.
       LEAP-EXIT.
         EXIT.
